package ua.goit;

import ua.goit.FrontEnd.StartFrame;

public class Main {
    public static void main(String[] args) {
        StartFrame.getInstance();
    }
}

/*
додав початкову ініціалізацію для поля виводу компа,
було - Комп'ютер: null
стало Комп'ютер очікує вводу першого слова
 */

//поправив назву папки Ресурси (була помилка в слові)

//переробив код в методі actionPerformed в класі GameFrame. Виводило завжди "перемогу", навіть при вводі "здаюсь"

//прибрав код, який ніде не використовується (в DataGame)

//виправив основний баг в неправильному виводі слів (надіюсь що виправив, треба більше тестів)

//зробив пару додаткових методів, щоб код був більш читаємий

//зробив рандомайзер, тепер комп виводить рандомні слова які починаються на певну букву

//залишив компу тільки один метод, compTurn

//залишив юзеру тільки один метод, playerTurn

